Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: In the sections that follow, three different methods will be described for installing the :term:`buildtools`, :term:`buildtools-extended` or :term:`buildtools-make` toolset.
it_it: Nelle sezioni seguenti, verranno descritti tre diversi metodi per installare i toolset :term:`buildtools`, :term:`buildtools-extended` o :term:`buildtools-make`.

source: In the snapshot above, we can see call chains that originate in ``libc``, and a call chain from ``Xorg`` that demonstrates that we're using a proprietary X driver in user space (notice the presence of ``PVR`` and some other unresolvable symbols in the expanded ``Xorg`` call chain).
it_it: Nell'immagine qui sopra, possiamo vedere catene di chiamate che hanno origine in ``libc`` e una catena di chiamate da ``Xorg`` che dimostra che stiamo usando un driver X proprietario nello spazio utente (notare la presenza di ``PVR`` e di altri simboli non risolvibili nella catena di chiamate ``Xorg`` espansa).

source: In this case, ``<version>`` should be the most recently released version of the software from the current source revision (``git describe`` can be useful for determining this). Whilst not recommended for published layers, this format is also useful when using :term:`AUTOREV` to set the recipe to increment source control revisions automatically, which can be useful during local development.
it_it: In questo caso, ``<version>`` dovrebbe essere la versione più recente del software rilasciata a partire dalla revisione corrente del codice sorgente (``git describe`` può essere utile per determinarla). Sebbene non sia consigliato per i layer pubblicati, questo formato è utile anche quando si utilizza :term:`AUTOREV` per impostare la ricetta in modo che incrementi automaticamente le revisioni del controllo di versione, il che può essere utile durante lo sviluppo locale.

source: In this case, we've filtered out all events that have ``perf`` in their ``comm``, ``comm_prev`` or ``comm_next`` fields. Notice that there are still events recorded for perf, but notice that those events don't have values of ``perf`` for the filtered fields. To completely filter out anything from perf will require a bit more work, but for the purpose of demonstrating how to use filters, it's close enough.
it_it: In questo caso, abbiamo filtrato tutti gli eventi che contengono ``perf`` nei campi ``comm``, ``comm_prev`` o ``comm_next``. Notare che sono ancora registrati eventi per perf, ma notate che questi eventi non hanno il valore ``perf`` per i campi filtrati. Per filtrare completamente tutto ciò che riguarda perf sarà necessario un lavoro più complesso, ma ai fini di questa dimostrazione sull'utilizzo dei filtri, è sufficiente.

source: In this example we have two possible vendors names, ``flex_project`` and ``westes``, with the product name ``flex``. With this setting the ``flex`` recipe only maps to this specific product and not products from other vendors with same name ``flex``.
it_it: In questo esempio, abbiamo due possibili nomi di fornitori, ``flex_project`` e ``westes``, con il nome del prodotto ``flex``. Con questa impostazione, la ricetta ``flex`` viene mappata solo a questo specifico prodotto e non a prodotti di altri fornitori con lo stesso nome ``flex``.

source: In this example, the binary for the ``bracket`` command (i.e. ``[``) from the ``busybox`` package resides in ``/usr/bin/``.
it_it: In questo esempio, il file binario per il comando ``bracket`` (ovvero ``[``) del pacchetto ``busybox`` si trova in ``/usr/bin/``.

source: In this example, the name of the top-level directory of your local Yocto Project repository is ``yocto-docs``. After moving to the ``yocto-docs`` directory, the ``git fetch`` command makes all the upstream tags available locally in your repository. Finally, the ``git checkout`` command creates and checks out a branch named "my_blacksail-6.1" that is based on the upstream branch whose "HEAD" matches the commit in the repository associated with the "blacksail-6.1" tag. The files in your repository now exactly match that particular Yocto Project release as it is tagged in the upstream Git repository. It is important to understand that when you create and check out a local working branch based on a tag, your environment matches a specific point in time and not the entire development branch (i.e. from the "tip" of the branch backwards).
it_it: In questo esempio, il nome della directory principale del repository locale di Yocto Project è ``yocto-docs``. Dopo essersi spostati nella directory ``yocto-docs``, il comando ``git fetch`` rende disponibili localmente nel repository tutti i tag upstream. Infine, il comando ``git checkout`` crea e effettua il checkout di un branch chiamato "my_blacksail-6.1" basato sul branch upstream il cui "HEAD" corrisponde al commit nel repository associato al tag "blacksail-6.1". I file nel repository ora corrispondono esattamente a quella specifica release di Yocto Project, così come è taggata nel repository Git upstream. È importante capire che quando si crea e si effettua il checkout di un branch di lavoro locale basato su un tag, l'ambiente corrisponde a un punto specifico nel tempo e non all'intero branch di sviluppo (ovvero, dalla "tip" [punta] del branch a ritroso).

source: Include your preferred branch prefix for ``-contrib`` repositories.
it_it: Includere il prefisso del branch che si preferisce per i repository ``-contrib``.

source: Index
it_it: Indice

source: Information in append files extends or overrides the information in the similarly-named recipe file. For an example of an append file in use, see the ":ref:`dev-manual/layers:appending other layers metadata with your layer`" section in the Yocto Project Development Tasks Manual.
it_it: Le informazioni contenute nei file append estendono o sovrascrivono le informazioni presenti nel file di ricetta con lo stesso nome. Per un esempio di file append in uso, consultare la sezione ":ref:`dev-manual/layers:appending other layers metadata with your layer`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: Information on any known bugs or issues that users should know about when either building or booting the BSP binaries.
it_it: Informazioni su eventuali bug o problemi noti di cui gli utenti dovrebbero essere a conoscenza durante la compilazione o l'avvio dei binari BSP.

source: Install - copy files to target directories
it_it: Install - copia dei file nelle directory di destinazione

source: Install Toaster Packages
it_it: Installare i Pacchetti di Toaster

source: Install Toaster dependencies using the ``--user`` flag which keeps the Python packages isolated from your system-provided packages::
it_it: Installare le dipendenze di Toaster utilizzando il flag ``--user``, che mantiene i pacchetti Python isolati dai pacchetti forniti dal proprio sistema::

source: Install and use bitbake-setup
it_it: Installazione e utilizzo di bitbake-setup

source: Installation
it_it: Installazione

source: Installation Options
it_it: Opzioni di Installazione

source: Installing ``python3-websockets`` using `Pip <https://pip.pypa.io/en/stable/>`__ in a virtual environment, e.g.:
it_it: Installazione di ``python3-websockets`` tramite `Pip <https://pip.pypa.io/en/stable/>`__ in un ambiente virtuale, ad esempio:

source: Installing a Pre-Built ``buildtools`` Tarball with ``install-buildtools`` script
it_it: Installazione di un tarball ``buildtools`` Pre-Built con lo script ``install-buildtools``

source: Instead of::
it_it: Invece di::

source: Instead the tilde (``~``) operator can be used, which sorts before the empty string so ``1.5~rc2`` comes before ``1.5``. There is a historical syntax which may be found where :term:`PV` is set as a combination of the prior version ``+`` the pre-release version, for example ``PV=1.4+1.5rc2``. This is a valid syntax but the tilde form is preferred.
it_it: In alternativa, è possibile utilizzare l'operatore tilde (``~``), che ordina prima della stringa vuota, quindi ``1.5~rc2`` viene prima di ``1.5``. Esiste una sintassi storica in cui :term:`PV` viene impostato come una combinazione della versione precedente ``+`` della versione di pre-release, ad esempio ``PV=1.4+1.5rc2``. Questa sintassi è valida, ma la forma con la tilde è preferibile.

source: Instructions on how to boot the BSP build from the BSP layer.
it_it: Istruzioni su come avviare la build del BSP dal layer BSP.

source: Instructions on how to boot the binary images contained in the ``binary`` directory, if present.
it_it: Istruzioni su come avviare le immagini binarie contenute nella directory ``binary``, se presente.

source: Instructions on how to build the BSP using the BSP layer.
it_it: Istruzioni su come compilare il BSP utilizzando il layer BSP.

source: Introducing the Yocto Project
it_it: Introduzione a Yocto Project

source: Introduction
it_it: Introduzione

source: Introduction and Overview
it_it: Introduzione e Panoramica

source: Isolating these packages is not required but is recommended. Alternatively, you can use your operating system's package manager to install the packages.
it_it: Isolare questi pacchetti non è obbligatorio, ma è consigliato. In alternativa, si può utilizzare il gestore di pacchetti del sistema operativo per installare i pacchetti.

source: It also contains ``sanity_info``, a text file keeping track of important build information such as the values of :term:`TMPDIR`, :term:`SSTATE_DIR`, as well as the name and version of the host distribution.
it_it: Contiene anche ``sanity_info``, un file di testo che tiene traccia di importanti informazioni di compilazione, come i valori di :term:`TMPDIR`, :term:`SSTATE_DIR`, nonché il nome e la versione della distribuzione host.

source: It becomes more complicated if everything can come from an sstate cache because some objects are simply not required at all. For example, you do not need a compiler or native tools, such as quilt, if there isn't anything to compile or patch. If the :ref:`do_package_write_* <ref-tasks-package_write_deb>` packages are available from sstate, BitBake does not need the :ref:`ref-tasks-package` task data.
it_it: La situazione si complica ulteriormente se tutto può provenire da una cache di stato, perché alcuni oggetti non sono affatto necessari. Ad esempio, non è necessario un compilatore o strumenti nativi, come quilt, se non c'è nulla da compilare o patchare. Se i pacchetti :ref:`do_package_write_* <ref-tasks-package_write_deb>` sono disponibili in sstate, BitBake non necessita dei dati del task :ref:`ref-tasks-package`.

source: It can be clearly isolated and defined by specific configuration.
it_it: Può essere chiaramente isolato e definito da una configurazione specifica.

source: It helps to understand some basic fundamental terms when learning the Yocto Project. Although there is a list of terms in the ":doc:`Yocto Project Terms </ref-manual/terms>`" section of the Yocto Project Reference Manual, this section provides the definitions of some terms helpful for getting started:
it_it: Per imparare a usare Yocto Project, è utile conoscere alcuni termini fondamentali. Sebbene la sezione ":doc:`Yocto Project Terms </ref-manual/terms>`" del Manuale di Riferimento di Yocto Project contenga un elenco di termini, questa sezione fornisce le definizioni di alcuni termini utili per iniziare:

source: It is a good idea to send a copy to the reviewers who provided feedback to the previous version of the patch. You can make sure this happens by adding a ``CC`` tag to the commit description::
it_it: È buona norma inviare una copia ai revisori che hanno fornito feedback sulla versione precedente della patch. Ciò avviene aggiungendo un tag ``CC`` alla descrizione del commit::

source: It is a little more difficult to follow the call chains than it needs to be --- luckily there's a variant of the function tracer that displays the call chains explicitly, called the ``function_graph`` tracer::
it_it: Seguire la catena delle chiamate è un po' più complicato del necessario, ma fortunatamente esiste una variante del tracer function che le visualizza esplicitamente, chiamato tracer ``function_graph``::

source: It is actually possible to send patches without generating them first. However, make sure you have reviewed your changes carefully because ``git send-email`` will just show you the title lines of each patch.
it_it: È possibile inviare patch anche senza generarle prima. Tuttavia, assicurarsi di aver esaminato attentamente le modifiche, perché ``git send-email`` mostrerà solo le righe del titolo di ciascuna patch.

source: It is advised to put these statements in a separate file as those contain secrets and should not be shared. For this example, let's assume this file is ``conf/sstate-sig-key.conf``.
it_it: Si consiglia di inserire queste istruzioni in un file separato, poiché contengono informazioni riservate e non devono essere condivise. Per questo esempio, supponiamo che il file si chiami ``conf/sstate-sig-key.conf``.

source: It is also possible to place output and configuration files in a directory separate from the :term:`Source Directory` by providing a directory name when you ``source`` the setup script. For information on separating output from your local Source Directory files (commonly described as an "out of tree" build), see the ":ref:`structure-core-script`" section.
it_it: È anche possibile posizionare i file di output e di configurazione in una directory separata dalla :term:`Source Directory`, specificando un nome di directory quando si esegue ``source`` lo script di configurazione. Per informazioni su come separare l'output dai file della Source Directory locale (comunemente descritta come una build "out of tree" [fuori albero]), consultare la sezione ":ref:`structure-core-script`".

source: It is also possible to set up the :term:`Poky` reference distro manually. For that refer to the :doc:`/dev-manual/poky-manual-setup` section of the Yocto Project Development Tasks Manual.
it_it: È inoltre possibile configurare manualmente la distribuzione di riferimento :term:`Poky`. Per maggiori informazioni, consultare la sezione :doc:`/dev-manual/poky-manual-setup` del Manuale di Sviluppo dei Task di Yocto Project.

source: It is also required to add the ``Upstream-Status:`` tag with a link to the original patch and sign-off by people working on the backport. If there are any modifications to the original patch, note them in the ``Comments:`` tag.
it_it: È inoltre necessario aggiungere il tag ``Upstream-Status:`` con un link alla patch originale e la firma del team che ha lavorato al backport. Eventuali modifiche alla patch originale devono essere annotate nel tag ``Comments:``.

source: It is also worth noting that the end result of these signature generators is to make some dependency and hash information available to the build. This information includes:
it_it: È inoltre importante notare che il risultato finale di questi generatori di firme è quello di rendere disponibili al processo di build alcune informazioni sulle dipendenze e sugli hash. Queste informazioni includono:

source: It is being actively and publicly tested (potentially using the :ref:`Autobuilder <test-manual/intro:Yocto Project Autobuilder Overview>` by agreement, or otherwise).
it_it: È in fase di test attivo e pubblico (potenzialmente utilizzando l':ref:`Autobuilder <test-manual/intro:Yocto Project Autobuilder Overview>` previo accordo, o in altro modo).

source: It is completely possible for a developer to structure the working repository as a conglomeration of unrelated BSP files, and to possibly generate BSPs targeted for release from that directory using scripts or some other mechanism (e.g. ``meta-yocto-bsp`` layer). Such considerations are outside the scope of this document.
it_it: È perfettamente possibile per uno sviluppatore strutturare il repository di lavoro come un insieme di file BSP non correlati e generare BSP destinati al rilascio da tale directory utilizzando script o altri meccanismi (ad esempio, il layer ``meta-yocto-bsp``). Tali considerazioni esulano dall'ambito di questo documento.

source: It is important to understand that Git tracks content change and not files. Git uses "branches" to organize different development efforts. For example, the :yocto_git:`yocto-docs </yocto-docs>` repository has several branches that include the current "blacksail" branch, the "master" branch, and many branches for past Yocto Project releases. You can see all the branches by going to :yocto_git:`yocto-docs </yocto-docs/>` and clicking on the ``[...]`` link beneath the "Branch" heading.
it_it: È importante capire che Git tiene traccia delle modifiche al contenuto e non ai file. Git utilizza i "branch" per organizzare i diversi progetti di sviluppo. Ad esempio, il repository :yocto_git:`yocto-docs </yocto-docs>` ha diversi branch, tra cui il branch corrente "blacksail", il branch "master" e molti branch per le release precedenti di Yocto Project. È possibile visualizzare tutti i branch accedendo a :yocto_git:`yocto-docs </yocto-docs/>` e cliccando sul link ``[...]`` sotto l'intestazione "Branch".

source: It is important to understand that when you create and check out a local working branch based on a branch name, your local environment matches the "tip" of that particular development branch at the time you created your local branch, which could be different from the files in the "master" branch of the upstream repository. In other words, creating and checking out a local branch based on the "blacksail" branch name is not the same as checking out the "master" branch in the repository. Keep reading to see how you create a local snapshot of a Yocto Project Release.
it_it: È importante capire che quando si crea e si seleziona un branch di lavoro locale in base al nome di un branch, l'ambiente locale corrisponde alla "tip" di quel particolare branch di sviluppo al momento della creazione del branch locale, che potrebbe essere diversa dai file presenti nel branch "master" del repository principale. In altre parole, creare e selezionare un branch locale in base al nome del branch "blacksail" non è la stessa cosa che selezionare il branch "master" nel repository. Continuare a leggere per scoprire come creare uno snapshot locale di una Release di Yocto Project.

source: It is not a requirement that a layer name begin with the prefix ``meta-``, but it is a commonly accepted standard in the Yocto Project community.
it_it: Non è obbligatorio che il nome di un layer inizi con il prefisso ``meta-``, ma è uno standard comunemente accettato nella community di Yocto Project.

source: It is not required that specific packages or package modifications exist in the BSP layer, beyond the requirements for general compliance with the Yocto Project. For example, there is no requirement dictating that a specific kernel or kernel version be used in a given BSP.
it_it: Non è richiesto che specifici pacchetti o modifiche di pacchetti siano presenti nel layer BSP, oltre ai requisiti generali di conformità con Yocto Project. Ad esempio, non esiste alcun requisito che imponga l'utilizzo di un kernel o di una versione del kernel specifici in un determinato BSP.

source: It is possible to set a root password for the image and also to set passwords for any extra users you might add (e.g. administrative or service type users). When you set up passwords for multiple images or users, you should not duplicate passwords.
it_it: È possibile impostare una password di root per l'immagine e anche impostare password per eventuali utenti aggiuntivi (ad esempio, utenti amministrativi o di servizio). Quando si impostano password per più immagini o utenti, è importante non duplicarle.

source: It is possible to sign these artifacts with :wikipedia:`GPG <GNU_Privacy_Guard>`. See :doc:`/security-manual/sstate-signing` in the Yocto Project Security Manual for more information.
it_it: È possibile firmare questi artefatti con :wikipedia:`GPG <GNU_Privacy_Guard>`. Per ulteriori informazioni, consultare :doc:`/security-manual/sstate-signing` nel Manuale di Sicurezza di Yocto Project.

source: It is recommended that out-of-tree support be fixed and used if at all possible.
it_it: Si raccomanda di correggere e utilizzare il supporto per le build out-of-tree, se possibile.

source: It is recommended to start this description with a title line which will serve a the subject line for the cover letter.
it_it: Si consiglia di iniziare la descrizione con un titolo che fungerà da oggetto per la lettera di presentazione.

source: It is very important that you make sure all post-Installation (``pkg_postinst``) scripts for packages that are installed into the image can be run at the time when the root filesystem is created during the build on the host system. These scripts cannot attempt to run during the first boot on the target device. With the "read-only-rootfs" feature enabled, the build system makes sure that all post-installation scripts succeed at file system creation time. If any of these scripts still need to be run after the root filesystem is created, the build immediately fails. These build-time checks ensure that the build fails rather than the target device fails later during its initial boot operation.
it_it: È fondamentale assicurarsi che tutti gli script di post-installazione (``pkg_postinst``) per i pacchetti installati nell'immagine possano essere eseguiti al momento della creazione del filesystem root durante la compilazione sul sistema host. Questi script non possono essere eseguiti al primo avvio del dispositivo target. Con la funzionalità "read-only-rootfs" abilitata, il sistema di build si assicura che tutti gli script di post-installazione vengano eseguiti correttamente al momento della creazione del filesystem. Se uno qualsiasi di questi script deve ancora essere eseguito dopo la creazione del filesystem root, la compilazione fallisce immediatamente. Questi controlli in fase di build garantiscono che sia la compilazione a fallire, anziché il dispositivo target a fallire in un secondo momento durante il suo boot iniziale.

source: It is worth considering the structure of a typical work directory. As an example, consider ``linux-yocto-kernel-3.0`` on the machine ``qemux86`` built within the Yocto Project. For this package, a work directory of ``tmp/work/qemux86-poky-linux/linux-yocto/3.0+git1+<.....>``, referred to as the :term:`WORKDIR`, is created. Within this directory, the source is unpacked to ``sources/linux-qemux86-standard-build`` and then patched by Quilt. (See the ":ref:`dev-manual/quilt:using quilt in your workflow`" section in the Yocto Project Development Tasks Manual for more information.) Within the ``linux-qemux86-standard-build`` directory, standard Quilt directories ``linux-3.0/patches`` and ``linux-3.0/.pc`` are created, and standard Quilt commands can be used.
it_it: Vale la pena considerare la struttura di una tipica directory di lavoro. Ad esempio, si consideri ``linux-yocto-kernel-3.0`` sulla macchina ``qemux86`` compilata nell'ambito di Yocto Project. Per questo pacchetto, viene creata una directory di lavoro ``tmp/work/qemux86-poky-linux/linux-yocto/3.0+git1+<.....>``, denominata :term:`WORKDIR`. All'interno di questa directory, il codice sorgente viene estratto in ``sources/linux-qemux86-standard-build`` e quindi patchato da Quilt. (Per ulteriori informazioni, consultare la sezione ":ref:`dev-manual/quilt:using quilt in your workflow`" del Manuale di Sviluppo dei Task di Yocto Project). All'interno della directory ``linux-qemux86-standard-build``, vengono create le directory standard di Quilt ``linux-3.0/patches`` e ``linux-3.0/.pc``, e si possono utilizzare i comandi standard di Quilt.
